import React from 'react';
export const aluminumProducts = [
    { id: "01",
    src: "https://drive.google.com/uc?export=download&id=1Z68JHIY1xJf7WFxoSX3eeU1SAOP06Ohz",
    title: "แท่นตัดอลูมิเนียม 12 ST-12",
    detail:"37107 รุ่น ST-12 PUMPKIN พัมคิน\nโต๊ะตัดอลูมิเนียม 12 (ไม่รวมใบเลื่อย)\nขนาดใบเลื่อย 305 m.m.\nตัดงานที่ 90 องศา 190 m.m.\nตัดงานที่ 45 องศา 145 m.m.\nตัดชิ้นงานสูง 105 m.m.\nความเร็วรอบ 3,300 R.P.M\nมอเตอร์ 1 HP\nกำลังไฟ 220-230 V.\nขนาด(กxยxส) 535x660x630\nน้ำหนัก 74 kg"
  },
  { id:'02',
  src: "https://drive.google.com/uc?export=download&id=1A3VB0Vmv6m9KWHxBoX7nsZsHKzTh0wRl",
    title: "ซิลิโคน แวคเกอร์ จีพี สีขาว 280 มล.",
    detail: "ซิลิโคนอเนกประสงค์จากผู้ผลิตซิลิโคนชั้นนำในประเทศเยอรมัน \nเหมาะแก่งานก่อสร้างและอุตสาหกรรมทั่วไป\nมีอายุการใช้งานยาวนาน ไม่ย้อยเวลาใช้งาน\nสามารถใช้งานได้ในอุณหภูมิ 5 - 40 องศา\nสามารถยึดเกาะพื้นผิวได้หลากหลาย เช่น กระจก พลาสติก หรือ พื้นผิวที่ทาสีแล้ว\nสามารถทนต่อสภาพอากาศและรังสียูวีได้ดี\nยางซิลิโคนที่มีความยืดหยุ่นถาวร\nเหมาะสำหรับงาน DIY และงานอุตสาหกรรม\nบรรจุ 25 หลอด / กล่อง    ",
  },
  { id:'03',
    src: "https://drive.google.com/uc?export=download&id=1ATQdsb0i1EuiuC1oF03OQ3usKySvKmlp",
    title: "Wacker sealant HYBRID HS ไส้กรอก สีขาว ขนาด 600 ml ไฮบริด ซีลแลนท์ สำหรับอุดรอยต่อของวัสดุ พียูผสม PU sealant",
    detail: " ไฮบริด ซีลแลนท์ สำหรับอุดรอยต่อของวัสดุ พียูผสม PU sealant\n- ผลิตภัณฑ์ไฮบริด เป็นผลิตภัณฑ์เอนกประสงค์ ใช้สำหรับการป้องกันการรั่วซึมในทุกสภาพพื้นผิว และสามารถทาสีทับได้\nประเภทการใช้งาน\n- ใช้ยาแนว ทาสีทับได้\n- การซ่อมแซมในบริเวณที่ต้องการความยืดหยุ่น\n- ยาแนวรอยต่อระหว่างวัสดุต่างๆ เช่น ไม้ กระจก โลหะ พลาสติกและพื้นผิวที่มีส่วนประกอบของแร่ต่างๆ\n- ยึดเกาะและซ่อมแซมพื้นผิวที่มีแรงตึง",
  },
  { id:'04',
    src: "https://drive.google.com/uc?export=download&id=10nhjLObqmA6Su-k0hIYbL4Z2x7hlumKs",
    title: "ฉากอลูมิเนียม Barco 1 นิ้ว x 1 นิ้ว หนา 1.2 มิล ยาว 6 เมตร",
    detail: "รผลิตจากวัสดุอลูมิเนียม 6063\nความยาว 120 ซม.\nคุณสมบัติเฉพาะ\nเหมาะกับงาน DIY\nสามารถดัดแปลงนำไปใช้ได้หลายรูปแบบ",
  },
  { id:'05',
    src: "https://drive.google.com/uc?export=download&id=1HETTYgJ1ATGpwL8zqbFvKp3g2Rnfm3mF",
    title: "ลวดเชื่อมไฟฟ้า KOBE รุ่น KB-K3026 ขนาด 2.6 มม. น้ำหนัด 2 กก.",
    detail: "ลวดเชื่อมไฟฟ้าเหล็กเหนียวเหมาะสำหรับงานเชื่อมเหล็กโครงสร้างขนาดเล็กทั่วไป\nผลิตจากแกนลวดและผงฟลักซ์คุณภาพสูง\nให้การอาร์คที่รุนแรง การซึมลึกทำได้ดีเยี่ยม ควันน้อย \nขนาด 2.6 มม./nความยาว 35 ซม.\nน้ำหนัก 2 กก.",
  },
  
  

  ];
  
export const stainlessProducts =[
    { id:'01',
        src: "https://drive.google.com/uc?export=download&id=1I-_8o2tqM139vXXT0eAimwRDWOTGrqXT",
        title: "อะลูมิเนียมกล่องลายไม้ 4 นิ้ว  ขนาด 3/4 x 4 นิ้ว x 2.97 เมตร สีไม้สัก",
        detail: "อะลูมิเนียมกล่องลายไม้ สำหรับติดตั้งเป็นรั้ว หรือระแนงบังแดด\nวัสดุผลิตจากอะลูมิเนียมอย่างดี คงทน ไม่เป็นสนิมง่าย\nลวดลายไม้ มีความสวยงามเป็นธรรมชาติ\nทนทานต่อทุกสภาพอากาศ\nติดตั้งง่าย แข็งแรง อายุการใช้งานยาวนาน\nขนาด 3/4 x 4 นิ้ว\\nหนา 1.2  มม.\nความยาว 6 เมตร\nสีไม้สัก",
      },
      { id:'02',
        src: "https://drive.google.com/uc?export=download&id=10uP0OrMdXD4wbOpW3mLUyyWB-6IGbraX",
        title: "อะลูมิเนียมกล่องลายไม้ 2 นิ้ว ขนาด 3/4 x 2 นิ้ว x 2.97 ม. สีไม้สัก",
        detail: "อะลูมิเนียมกล่องลายไม้ สำหรับติดตั้งเป็นรั้วหรือระแนงบังแดด\nผลิตจากอะลูมิเนียมอย่างดี คงทน ไม่เป็นสนิมง่าย\nฟิล์มลายไม้สวยงามเสมือนไม้จริง\nแข็งแรง ทนทานต่อทุกสภาพอากาศ\nติดตั้งง่าย อายุการใช้งานยาวนาน\nขนาด (ส x ก) 3/4 x 2 นิ้ว ความยาว 6  เมตร\nความหนา 1.2  มม.\nสีไม้สัก",
      },
      { id:'03',
        src: "https://drive.google.com/uc?export=download&id=1WX2weJrpvQdpITg_TPgXJdhci6ZY0mbx",
        title: "ใบตัดเหล็ก / ตัดสแตนเลส ขนาด 4 นิ้ว หนา 1.0 มิล ตัดเร็ว ตัดไว คมกริบ ไร้เทียมทาน",
        detail: "ใบตัดบาง ที่มีความหนาเพียง 1.0 มิลลิเมตร ทำให้ตัดชิ้นงานได้ตรง ละเอียดและแม่นยำ\nทนต่อการใช้งานหนัก ตัดชิ้นงานได้ต่อเนื่อง ตัดเร็ว ตัดไว ไร้รอยไหม้ และไม่กินเนื้องาน\nเหมาะสำหรับงานตัดวัสดุที่มีขนาดเล็กและบาง เช่น สแตนเลส เหล็กกลวง เหล็กตัน อัลลอยสตีล\nขนาดใบตัด : 105 x 1.0 x 16 mm\nเส้นผ่าศูนย์กลาง : 4 นิ้ว ( 105 mm )\nความหนาของแผ่นตัด : 1.0 mm\nขนาดรูวงใน : 16 mm.\nความเร็วรอบสูงสุด : 14,600 RPM 80m/s",
      },
      { id:'04',
        src: "https://drive.google.com/uc?export=download&id=1mAQFKsA0a0nKHVGpz8Enb8bp0k70cLZT",
        title: "เกจ์ปรับแรงดันลมอาร์กอน หน้าปัดขนาด 2 นิ้ว ครอบด้วยยางกันกระแทก หลอดโฟลมิเตอร์ แบบเกลียวตรงไม่มีบ่า ทำจากโพลีคาร์บอเนต เหนียว ทนทาน ไม่แตกง่าย",
        detail: "Type of Gas : Argon\nMax Inlet Pressure : 150 bar\nMax Outlet Pressure : 3 bar\nMax Flow (Lit/min - ft²/h) : 1-25\nInlet Connection : CGA580Outlet \nConnection : 9/16 -18 UNF",
      },
      { id:'05',
        src: "https://drive.google.com/uc?export=download&id=1pI-Yidarp-rwaIAvzBRHBX7r53cOGvOy",
        title: "น้ำยาลบรอยเชื่อม สแตนเลส สามารถลบ รอยไหม้ รอยคราบ จากการเชื่อม TIG ไม่ทำให้เกิดรอยด่าง",
        detail: "น้ำยาลบรอยเชื่อมสแตนเลส\nน้ำยาลบรอบเชื่อม สแตนเลส ลบรอยไหม้ จากการเชื่อม TIG และคราบสนิม\nสามารถทาน้ำยาทิ้งใว้ได้หลายแนวเชื่อม และล้างออกด้วยน้ำสะอาดโดยไม่ทำให้เกิดรอยด่าง"
      },
      { id:'06',
        src: "https://drive.google.com/uc?export=download&id=1fsZf_XxYbvPiZHImeASnLEl7HTNQvE4t",
        title: "ผงขัดเงาสแตนเลส ใช้ทำความสะอาด สแตนเลส อลูมิเนียม โลหะทุกชนิด เงิน เหล็ก ทองแดง ทองเหลือง ฯลฯ ",
        detail: "ผงขัดเงาสีขาว สำหรับ ขัดสแตนเลส, ทองเหลือง\nเหมาะสำหรับทำความสะอาด และ ขัดเงาโลหะ ทุกชนิด อาทิ สแตนเลส อลูมิเนียม เงิน เหล็ก ทองแดง ทองเหลือง เป็นต้น \n ปริมาณสุทธิ 100 กรัม",
      },
      { id:'07',
        src: "https://drive.google.com/uc?export=download&id=12_AEaBsyeDl2Kj6WCBERMYfMAT3GAh9f",
        title: "สายเชื่อมทิกพร้อมหัว WP-26V ข้อต่อ PANA สำหรับเครื่องเชื่อมทิก มีวาล์วสำหรับควบคุมการใหลของแก๊ส สายเชื่อมมีความยืดหยุ่น สามารถเชื่อมติดต่อกันระยะเวลาที่นานได้",
        detail: "Rating : 200Amps DC , 150Amps AC\nDuty cycle    :    60%\nWire size      :    1.6-3.2 mm\nConnector    :     Pana",
      },
      { id:'08',
        src: "https://drive.google.com/uc?export=download&id=1cc8Ns6NL8fUzcW0aNgyzomIr3GrZVnCM",
        title: "นมเซรามิก WP-26 เบอร์ 4 ขนาด 6 มม นมหนูเซรามิกที่มีความแข็งแรงทนทาน ทนต่อความร้อนสูง ไม่เสียรูปแม้เจอความร้อนสูง ",
        detail: "ใช้กับ WP-17/18/26\nสำหรับควบคุมทิศทางของแก๊สอาร์กอนให้เข้าสู่ชิ้นงานขณะเชื่อม\nผลิตจากเซรามิกคุณภาพดี แข็งแรงทนทาน\nสามารถใช้งานได้อย่างปลอดภัยแม้ขณะความร้อนสูง\nเมื่อใช้งานด้วยความร้อนสูงแล้วเกิดรอยไหม้จะไม่ละลาย คงรูปทรงเดิม",
      },
      { id:'09',
        src: "https://drive.google.com/uc?export=download&id=1h6RCfmobQHafnbW2lPhOfrsvGuPEf2zF",
        title: "ด้ามเชื่อม WP-26F เป็นหัวเชื่อมที่สามารถปรับได้ตามความผู้ใช้งาน ให้สามารถเชื่อมได้หลายมุม",
        detail: "ให้สามารถเชื่อมได้หลายมุม และตัวด้ามจับออกแบบมาให้ผู้ใช้จับได้สะดวกมือ ด้ามเชื่อมระบายด้วยอากาศ",
      },
      { id:'10',
        src: "https://drive.google.com/uc?export=download&id=1yGexIriwbCL_HaN0SFJYBkcDLRjT9z1_",
        title: "จานทรายซ้อนหลังอ่อน เบอร์ 40, 60, 80 ขนาด 4 นิ้ว ",
        detail: "จานทรายซ้อนหลังอ่อนสำหรับงานขัดเหล็ก สแตนเลส และไม้\nผลิตจากอะลูมิเนียมออกไซด์ ซึ่งเป็นวัสดุขัดถูที่แข็ง คม และเหนียวทนทานที่สุดในการใช้งานทั่วไป\nเส้นผ่านศูนย์กลางแผ่นขัด ขนาด 4 นิ้ว\nบรรจุ 5 ชิ้น/แพ็ก",
      },
      { id:'11',
        src: "https://drive.google.com/uc?export=download&id=1wbir-c63I7vjWUmt8wevPSDV7lLsfAkb",
        title: "BOSS ผ้าทรายสายพาน ขนาด 4x24นิ้ว เบอร์40 ",
        detail: "ผ้าทรายสายพาน สำหรับงานขัดแต่ง ลบคมในบริเวณพิ้นจำกัด\nใช้สำหรับเครื่องสายพานขนาดเล็ก\nสำหรับงานสเตนเลสหรือเหล็กกล้าทั่วไป ที่ต้องการกัดกินสูง\nใช้งานง่าย สะดวก รวดเร็ว ประหยัดกว่าใช้ใบเลื่อย\nไร้รอยต่อผ้าทรายแข็งแรง ปลอดภัย",
      },
      
    
  ];



  export const roofProducts = [
    {
      id:'01',
      src: "https://drive.google.com/uc?export=download&id=1os3fOQ627ijiNybHBfO05jizJjuG7fDF",
      title: "แผ่นหลังคาเมทัลชีท 0.40 มม.",
      detail: "สังกะสีสำหรับมุมหลังคาอาคาร สิ่งก่อสร้าง เช่น โรงรถ ที่พักอาศัย รั้วเขตสังกะสี\nเป็นสังกะสีแบบลูกฟูกลอนใหญ่ ทรงลอนมาตรฐาน \nผลิตจากแผ่นเหล็กเคลือบชุบสังกะสีคุณภาพ แข็งแรงทนทาน สีสันคงทนสวยงาม\nมีระบบป้องกันสนิม 2 ชั้น ป้องกันการกัดกร่อน และบริเวณขอบตัด\nขนาด (กว้าง x ยาว) 2.5 ฟุต x 5 ฟุต\nสีแดง",
    },
      
    
    
  ];

  export const mirrorProducts = [
    {
      id:'01',
      src: "https://drive.google.com/uc?export=download&id=1bm-De27YUhFeIzmMG7-q8C0VMDnkAD8i",
      title: "กระจกเทมเปอร์ สีใส CLEAR หนา 5 มม./6 มม. /8 มม. /10 มม.12 มม.",
      detail: "กรุณาแจ้งขนาด และจำนวนที่ต้องการ (ขนาดใหญ่สุดที่ผลิตได้ 2.8x6 เมตร)",
    },
    {
      id:'02',
      src: "https://drive.google.com/uc?export=download&id=1BSv9AEmbCpxsntYNA2tP8R2aj7HRAryt",
      title: "กระจกลามิเนต ฟิล์มใส CL 0.38 3+3 mm/4+4/5+5+6+6/8+8/10+10/12+12 mm.",
      detail: "กระจกลามิเนต ฟิล์มใส\nคุณลักษณะสำคัญ	กระจกลามิเนต เป็นหนึ่งในกระจกนิรภัย ซึ่งมีความปลอดภัยค่อนข้างสูง ซึ่งเวลาแตกแล้วเศษกระจกจะยึดติดกันไม่ร่วงหล่น \nเพราะมีชั้นฟิล์มยึดติดระหว่างแผ่นกระจก \nมีขนาดตั้งแต่ 3+3 ถึง 12+12\nหน่วยมาตรฐาน	1.00 ตารางเมตร (ตร.ม.) = 10.764 ตารางฟุต (ตร.ฟุต)",
    },
      
      
    
    
  ];


export const accessoriesstainlessProducts  = [
    {
      id:'36',
      src: "/roof sheet/1.png",
      title: "accessoriesstainless",
      detail: "สินค้าทดลอง",
    },
      
    { id:'37',
      src: "/roof sheet/2.jpg",
      title: "accessoriesstainless",
      detail: "สินค้า แจกฟรี",
    },
    { id:'38',
      src: "/roof sheet/3.jpg",
      title: "accessoriesstainless",
      detail: "สินค้าทดลอง",
    },
    { id:'39',
      src: "/roof sheet/4.png",
      title: "accessoriesstainless",
      detail: "สินค้า แจกฟรี",
    },
    { id:'40',
      src: "/roof sheet/5.jpg",
      title: "accessoriesstainless",
      detail: "สินค้า แจกฟรี",
    },
  
];

export const ceilingtoolsProducts  = [
  {
    id:'01',
    src: "https://drive.google.com/uc?export=download&id=1J0BDMQ9mR4J83PdnQZ70nJ70hh_f_0yK",
    title: "แผ่นยิปซัมมาตรฐาน ตราช้าง ขอบลาด 9 มม. 1200X2400 มม.",
    detail: "น้ำหนัก : 15.5 กก.\nวัสดุยิปซัม\nคำแนะนำ การใช้สินค้าติดตั้งประกอบกับโครงคร่าวฝ้าเพดานฉาบเรียบโปร-ลายน์ ตราช้าง\nการดูแลรักษากองเก็บแผ่นยิปซัมในพื้นที่อาคารที่สะอาด, พื้นเรียบ, แห้ง และปราศจากความชื้น",
  },
    
  { id:'02',
    src: "https://drive.google.com/uc?export=download&id=1bYwXQoNj5iS7KQXRUGnnBX7XAc5OaTEx",
    title: "ยิปซัม แผ่นทนความชื้น 1200x2400x9 มม. ขอบลาด RE",
    detail: "ขนาด1200x2400x9 มม.\n น้ำหนัก17.00 กก.\nราคาส่งมอบหน้าโรงงาน ราคาก่อน ภาษีมูลค่าเพิ่ม VAT 7%",
  },
  { id:'03',
    src: "https://drive.google.com/uc?export=download&id=11its9ZOB3AIdgGH0VRJLkJ0G823AgUXj",
    title: "ยิปซัม แผ่นกันร้อน 1200x2400x9 มม. ขอบลาด RE ",
    detail: "แบรนด์ TOA ทีโอเอ\nขนาด1200x2400x9 มม.\nน้ำหนักต่อแผ่น (กก.)16.20",
  },
  { id:'04',
    src: "https://drive.google.com/uc?export=download&id=1MxhuY7QoF38LlmIlm1bmqIlMs_VFj9Nr",
    title: "สมาร์ทบอร์ด SCG ขอบเรียบ 120x240x 4 มม./6มม./8มม./10มม./12มม.",
    detail: "แบรนด์ SCG เอสซีจี\n ขนาด แผ่นไฟเบอร์ซีเมนต์บอร์ด หนา 8 มม. \nเหมาะกับการติดตั้งผนังทั้งภายใน ภายนอก ขอบเรียบ ติดตั้งแบบเว้นร่อง สามารถใช้ทำเป็นแผ่นรองวัสดุได้ สำหรับงานแผ่นรองพื้นวัสดุ ต้องใช้อุปกรณ์ยึดยาว 1 นิ้ว สำหรับพื้น 8 มม.\nน้ำหนักต่อแผ่น (กก.)34.80",
  },
  { id:'05',
    src: "https://drive.google.com/uc?export=download&id=1lTW7ER9SoDsiXVZhqWUW4vau6Ya0Ikpt",
    title: "สมาร์ทบอร์ด SCG ลายไม้ ระบายอากาศ 60x120x0.4 ซม. ",
    detail: "ชื่อเรียกสินค้า	แผ่นสมาร์ทบอร์ด Smart Board ไฟเบอร์ซีเมนต์บอร์ด\nตราสินค้า	เอสซีจี สมาร์ทบอร์ด\nวัตถุดิบ	เส้นใยไฟเบอร์ ซีเมนต์\nแหล่งผลิตสินค้า	ประเทศไทย/nคุณลักษณะสำคัญ	ทนน้ำ ทนแดด ไม่บวมน้ำ ไม่เปื่อยยุ่ยเมื่อโดนน้ำ ตามมาตรฐาน JIS A5420 เหมาะกับการใช้ได้ทั้งภายใน และภายนอก เมื่อโดนน้ำ เนื้อจะเหมือนปูนมีรอยน้ำ แล้วจะระเหยไปเอง น้ำหนักมากเมื่อเทียบกับ วู๊ดซีเมนต์บอร์ด แต่ทนน้ำกว่า ทนปลวก เนื้อวัสดุไม่เป็นอาหารของปลวก สามารถดัดโค้งได้ มีค่าการนำความร้อนต่ำ\nข้อควรรู้ User Tips	ดัดโค้งได้ เหมาะกับงานฝ้าเพดาน",
  },
  { id:'06',
    src: "https://drive.google.com/uc?export=download&id=1uagNkxjQDoO-5mLSvAlUKU1UxYb66c2Q",
    title: "ปูนอีซี่ควิก ตราช้าง (ฉาบรอยต่อ)",
    detail: "ข้อมูลทางเทคนิค:\nระยะเวลาทำงาน : 60 นาที\nระยะเวลาแห้งตัว : 75 นาที\nอัตราส่วนผสม ปูน : น้ำ : 2:1 โดยน้ำหนัก\nปริมาณใช้งาน : 50-60 ตร.ม. ของแผ่นยิปซัม\nระยะเวลาเก็บรักษา : 6 เดือน/nพื้นที่และการใช้งาน:ใช้สำหรับฉาบรอยต่อแผ่นยิปซัม ฉาบปิดรอยหัวสกรู และฉาบตกแต่งผิวหน้าแผ่นยิปซัมเพื่อเก็บงานครั้งสุดท้าย สำหรับงานฝ้าเพดานและผนังภายใน\nขนาดบรรจุถุงละ 25 กก.",
  },
  { id:'07',
    src: "https://drive.google.com/uc?export=download&id=1T6sTP7cQLXTL3NOGWnaLqcYfwGmgJUkx",
    title: "สกรูดำ ",
    detail: "สำหรับใช้ยิงฝ้า ยิปซั่ม ไม้ อะลูมิเนียม ซีลาย สะดวกในการใช้งาน\nผลิตจากวัสดุคุณภาพดี ไม่เป็นสนิม ไม่แตกหักง่าย\nคงรุปร่างได้ดี ไม่คดง่าย\nปลายแหลม เกลียวไม่ล้ม เจาะได้อย่างง่ายดาย\nมีความยืดหยุ่นสูง ทนแรงกระแทกได้ดี\nเกลียวลึกเสมอตลอดทั้งตัว\nแข็งแรงทนทาน ใช้งานได้ดี\nกล่อง 420 ชิ้น\nขนาด (กว้าง x ลึก) 5 x 19 มม.\nสีดำ",
  },
  { id:'08',
    src: "https://drive.google.com/uc?export=download&id=1hnQWAKkIIdBubZ8RHvGzFpv8QBjfxvKC",
    title: "ตะขอ ป.ปลา หิ้วรางตัวซี ",
    detail: "อุปกรณ์สำหรับช่วยยึดกับโครงฝ้าเพดาน เพื่อความคงทน\nผลิตจากโลหะคุณภาพดี ไม่เป็นสนิม ไม่หักง่าย\nเพื่อความเป็นระเบียบเรียบร้อยสวยงาม\nติดตั้งง่าย รับน้ำหนักได้ดี\nมีความยืดหยุ่นสูง ทนแรงกระแทกได้ดี\nคงรูปร่างได้ดี ไม่บิดงอง่าย\nแข็งแรง ทนทาน ใช้งานได้นาน\nบรรจุ 100 ชิ้น/แพ็ค \nขนาด (กว้าง x ลึก) 0.75 x 6.5 นิ้ว\nสีเงิน",
  },
  { id:'09',
  src: "https://drive.google.com/uc?export=download&id=1cUAXYPeIsZqWx0BIEM04Tf8CuhiJJoVC",
  title: "สปริงดำ  ขนาด 1 x 4.5 นิ้ว (แพ็ค 100 ชิ้น)",
  detail: "สำหรับประกอบกับชุดแชวนโครงคร่าวเพื่อเพิ่มความแข็งแรง\nผลิตจากโลหะคุณภาพดี แข็งแรงทนทาน ไม่เป็นสนิม ไม่แตกหักง่าย\nคงรูปร่างได้ดี ไม่บิดงอง่าย\nติดตั้งสะดวก ไม่ยุ่งยาก\nทนต่อสภาพอากาสได้ดี\nแข็งแรงทนทาน ทนทาน สามารถใช้งานได้ยาวนาน\nบรรจุ 100 ชิ้น/แพ็ค\nขนาด (กว้าง x ลึก) 1 x 4.5 นิ้ว\nสีดำ",
},
{ id:'10',
src: "https://drive.google.com/uc?export=download&id=1rnMyQMSiNueSVPfwb7Kf8Xgom9fxHFfp",
title: "ผ้าเทปยิปซั่ม (แพ็ค 3 ชิ้น) สีขาว",
detail: "สำหรับปิดรอยกับงานยิปซัม และงานก่ออิฐฉาบปูน\nผลิตจากวัสดุอย่างดี เหนียว ไม่ขาดง่าย\nเนื้อผ้าบางละเอียด ปิดรอยต่อได้เรียบสนิท\nติดได้แน่นหนา สามารถทาสีทับได้\nใช้งานได้ทั้งภายใน และภายนอกอาคาร\nติดตั้งสะดวก ไม่ยุ่งยาก\nแพ็ค 3 ชิ้น\nความยาว 7.2 เมตร/ม้วน\nสีขาว\nหมายเหตุ : สีของผลิตภัณฑ์ที่แสดงบนเว็บไซต์อาจมีความแตกต่างกันจากการตั้งค่าการแสดงผลสีของแต่ละหน้าจอ",
},
{ id:'11',
src: "https://drive.google.com/uc?export=download&id=1bE0WEHA6SKdoltyTinEFBXG5_WeAFVGX",
title: "กิ๊บล๊อค ล็อคกิ้งคีย์  ขนาด 2.5 x 4 นิ้ว (แพ็ค 100 ตัว)",
detail: "ใช้ยึดโครงซีลายน์เข้าด้วยกัน สำหรับโครงคร่าวเพดาน\nผลิตจากวัสดุอย่างดี ไม่เป็นสนิม ไม่แตกหักง่าย\nมีความยืดหยุ่นสูง ทนแรงกระแทกได้ดี\nคงรูปร่างได้ดี ไม่บิดงอง่าย\nติดตั้งสะดวก ไม่ยุ่งยาก\nทนต่อสภาพอากาสได้ดี\nแข็งแรงทนทาน ทนทาน สามารถใช้งานได้ยาวนาน\nบรรจุ 100 ชิ้น/แพ็ก\nขนาด (กว้าง x ลึก) 2.5 x 4 นิ้ว \nสีเงิน",
},
{ id:'12',
src: "https://drive.google.com/uc?export=download&id=1A-wwRjvdqd_JQK0aVg9JS4uIM7IFNC8T",
title: "โครงผนังตัวซี 65 มม. ขนาด 3 เมตร",
detail: "สำหรับใช้เป็นโครงสร้างรับผนัง\nผลิตจากเหล็กชุบสังกะสีด้วยเครื่องจักรที่ทันสมัยได้มาตรฐาน\nมีความคงทน ไม่เป็นสนิมง่าย มีน้ำหนักเบา\nติดตั้งได้อย่างรวดเร็ว ช่วยลดขั้นตอน ประหยัดเวลาในการทำงาน\nมีโครงสร้างที่ทนต่อการลุกลามของไฟได้ดี\nปลอดภัยจากปลวก มอด และแมลง\nแข็งแรงทนทาน ใช้งานได้นาน\nความหนา 0.26 มม.\nขนาด (กว้าง x ลึก x สูง) 6.5 x 300 x 3.3 ซม.",
},

{ id:'13',
src: "https://drive.google.com/uc?export=download&id=1dy8dLHTOhds0EHzbDx4hgJBYh1lGH4FH",
title: "ฉากสังกะสี ขนาด 8 ฟุต",
detail: "สำหรับวางโครงคร่าวเพดาน\nผลิตจากวัสดุอย่างดี ไม่เป็นสนิม ไม่แตกหักง่าย\nทนแรงกระแทกได้ดี มีความยืดหยุ่นสูง\nคงรูปร่างได้ดี ไม่บิดงอง่าย สามารถใช้งานได้ยาวนาน\nแข็งแรง ทนทานต่อการใช้งาน\nขนาด (กว้าง x ลึก) 0.19 x 240 ซม.\nสีเงิน",
},

{ id:'14',
src: "https://drive.google.com/uc?export=download&id=1wV7sfwuiy-INCCFB0j35R6urVhHtcC_U",
title: "โครงผนัง ยูซอย Size 7.5 x 60 ซม.",
detail: "สำหรับใช้เป็นโครงสร้างรับผนัง\nผลิตจากเหล็กชุบสังกะสีด้วยเครื่องจักรที่ทันสมัยได้มาตรฐาน\nมีความคงทน ไม่เป็นสนิมง่าย มีน้ำหนักเบา\nติดตั้งได้อย่างรวดเร็ว ช่วยลดขั้นตอน ประหยัดเวลาในการทำงาน\nมีโครงสร้างที่ทนต่อการลุกลามของไฟได้ดี\nปลอดภัยจากปลวก มอด และแมลง\nแข็งแรงทนทาน ใช้งานได้นาน\nขนาด (กว้าง x ลึก x สูง) 7.5 x 60 x 2.9 ซม.\nสีเงิน",
},

{ id:'15',
src: "https://drive.google.com/uc?export=download&id=1BxUmnK41SLZhsGZJH3zhfb3tApafyDMv",
title: "แปสังกะสี #24 ขนาด 4 เมตร ",
detail: "สำหรับใช้ยึดติด ผนัง กำแพง ฝ้า หลังคา มีน้ำหนักเบา ติดตั้งง่าย\nผลิตจากวัตถุดิบและเครื่องจักรที่ได้มาตรฐาน\nรูปทรงของสินค้าที่คำนึงถึงความแข็งแรงในการรับน้ำหนักกระเบื้องหลังคาได้เป็นอย่างดี\nออกแบบเพิ่มในส่วนของปีกแปหลังคา ทำให้ง่ายต่อการติดตั้ง\nไม่บิดงอง่าย ช่วยให้ติดตั้งง่าย ทนแรงกระแทก และรอยขีดข่วนได้ดี\nมีน้ำหนักเบา ติดตั้งง่าย ช่วยลดขั้นตอน ประหยัดเวลาในการทำงาน\nรองรับน้ำหนักได้ดี สามารถกระจายน้ำหนักไปยังส่วนรับที่ยึดติดได้ดีเยี่ยม\nขนาด 4 เมตร \nคาดม่วง - สีเงิน\nหมายเหตุ : สีของผลิตภัณฑ์ที่แสดงบนเว็บไซต์อาจมีความแตกต่างกันจากการตั้งค่าการแสดงผลสีของแต่ละหน้าจอ",
},
{ id:'16',
    src: "https://drive.google.com/uc?export=download&id=1jfnFJf0bQg-h4VCajqCtFIrgQ6TGIbzX",
    title: "ลวดโยงโครงคร่าว เบอร์ 8 GIANT KINGKONG",
    detail: "ลวดสำหรับยึดโครงคร่าวฝ้าเพดาน\nผลิตจากโลหะคุณภาพดี มีความคงทนสูง แข็งแรง ทนทานต่อการใช้งาน\nผ่านกระบวนการผลิตที่ได้มาตรฐานจาก GIANT KINGKONG\nเบอร์ \nขนาดเส้นผ่านศูนย์กลาง 0.3 ซม.\nความยาว 3 เมตร (300 ซม.)"
},
{ id:'17',
    src: "https://drive.google.com/uc?export=download&id=1uQYXlKc32dmTV3cG3mqjbAs0HyXqoRnr",
    title: "พุกเหล็ก  รุ่น P-12038 ขนาด 1.5 หุน / 2 หุน / 3 หุน /4 หุน  สีซิงค์รุ้ง",
    detail: "พุกเหล็กใช้สำหรับยึดเหล็กกับคอนกรีต? มีโบลท์และนอตมาให้พร้อมใช้งาน\nผลิตจากเหล็กชุบซิงค์ ไม่แตกหัก และเป็นสนิมง่าย\nความละเอียดเกลียวหุน เกลียวแข็งแรง ทนทาน\nช่วยรับแรงยึดวัสดุที่ต้องรับน้ำหนักสูง\nรองรับน้ำหนักได้ 2,500 กก.\nสามารถใช้งานได้ทั้งภายในและภายนอก\nเหมาะสำหรับงานติดตั้ง เช่น ผนังอาคาร, อุปกรณ์ลิฟท์, เครื่องจักร, ท่อประปา เป็นต้น\nมาร์คจุดที่จะเจาะรูคอนกรีต แล้วเจาะรูคอนกรีตตามขนาดและความลึกตามที่กำหนดไว้ จากนั้นทำความความสะอาดรูคอนกรีต โดยใช้แปรงหรือลมเป่าnสอดพุกเข้าไปจนสุดแล้วไขหัวนอตให้แน่น ต้องระวังไม่ไขมากเกินไปจนปลอกพุกยื่นเลยแกนพุก\nคลายหัวนอตและแหวนอีแปะออกเอาวัตถุที่จะยึดสวม แล้วใส่แหวนอีแปะและหัวนอตแล้วขันให้แน่น"
},

];

const ProductsData = () => {
  return (
    <div>

    <h1>Mirror Products</h1>
    {aluminumProducts.map(product => (
      <div key={product.id}>
        <img src={product.src} alt={product.title} />
        <h2>{product.title}</h2>
        <p>{product.detail}</p>
      </div>
    ))}


<h1>Mirror Products</h1>
    {stainlessProducts.map(product => (
      <div key={product.id}>
        <img src={product.src} alt={product.title} />
        <h2>{product.title}</h2>
        <p>{product.detail}</p>
      </div>
    ))}


    <h1>Mirror Products</h1>
    {mirrorProducts.map(product => (
      <div key={product.id}>
        <img src={product.src} alt={product.title} />
        <h2>{product.title}</h2>
        <p>{product.detail}</p>
      </div>
    ))}



    <h1>Accessories Stainless Products</h1>
    {accessoriesstainlessProducts.map(product => (
      <div key={product.id}>
        <img src={product.src} alt={product.title} />
        <h2>{product.title}</h2>
        <p>{product.detail}</p>
      </div>
    ))}

<h1>Mirror Products</h1>
    {ceilingtoolsProducts.map(product => (
      <div key={product.id}>
        <img src={product.src} alt={product.title} />
        <h2>{product.title}</h2>
        <p>{product.detail}</p>
      </div>
    ))}
  </div>
  );
};

export default ProductsData;
  